"use strict";
var __importDefault = (this && this.__importDefault) || function (mod) {
    return (mod && mod.__esModule) ? mod : { "default": mod };
};
Object.defineProperty(exports, "__esModule", { value: true });
exports.Ai = void 0;
const fs_1 = __importDefault(require("fs"));
const openai_1 = __importDefault(require("openai"));
const tool_js_1 = __importDefault(require("../modules/tool.js"));
const process_1 = __importDefault(require("process"));
class Ai {
    static async initial() {
        try {
            const jsonStringQA = JSON.stringify(this.defaultQA);
            const file1 = tool_js_1.default.randomString(10) + '.json';
            const openai = new openai_1.default({
                apiKey: process_1.default.env.OPENAI_API_KEY,
            });
            fs_1.default.writeFileSync(file1, jsonStringQA);
            const file = await openai.files.create({
                file: fs_1.default.createReadStream(file1),
                purpose: 'assistants',
            });
            Ai.files.guide = file.id;
            fs_1.default.rmSync(file1);
        }
        catch (e) { }
    }
}
exports.Ai = Ai;
Ai.files = {
    guide: '',
};
Ai.defaultQA = [
    {
        request: ['請問要如何新增訂單', '新增訂單該怎麼做'],
        response: '請前往訂單管理的「訂單」，點擊右上角「新增」即可新增訂單',
    },
    {
        request: ['請問要如何編輯訂單', '編輯訂單該怎麼做', '如何修改訂單'],
        response: '請前往訂單管理的「訂單」，點擊一份訂單進行編輯操作',
    },
    {
        request: ['請問要如何封存訂單', '封存訂單該怎麼做'],
        response: '請前往訂單管理的「訂單」，在列表中勾選想要封存的訂單，即可批量封存',
    },
    {
        request: ['請問要如何解除封存訂單', '解除封存訂單該怎麼做'],
        response: '請前往訂單管理的「已封存訂單」，在列表中勾選想要解除封存的訂單，即可批量解除封存',
    },
    {
        request: ['請問要如何刪除訂單', '刪除訂單該怎麼做'],
        response: '目前系統沒有設計訂單刪除的功能，僅可勾選想要封存的訂單，將訂單以封存的方式改變狀態',
    },
    {
        request: [
            '請問要如何搜尋訂單',
            '搜尋訂單該怎麼做',
            '我想要按照日期排序訂單，該怎麼做',
            '可以只顯示付款狀態已付款的訂單嗎',
        ],
        response: '請前往訂單管理的「訂單」，在列表左上方可以根據訂單編號、訂購人姓名、商品名稱等進行關鍵字搜尋，也可以在右上選擇篩選和排序，可以做到更仔細的訂單查詢',
    },
    {
        request: ['請問要如何查看訂單狀態', '訂單付款狀態如何得知', '訂單出貨狀態如何得知', '請問出貨狀態在哪'],
        response: '請前往訂單管理的「訂單」，點擊任一訂單，在右上角有出貨狀態、付款狀態、訂單進度的顯示，也可以在詳細訂單中查看更多內容',
    },
    {
        request: ['請問要如何匯出訂單列表', '匯出訂單列表要怎麼做', '有辦法匯出訂單'],
        response: '請前往訂單管理的「訂單」，點擊右上角「匯出」即匯出當前搜尋結果的訂單excel檔案',
    },
    {
        request: ['如何上架商品', '如何下架商品', '有辦法上架或下架多個商品嗎', '上架商品', '下架商品'],
        response: '請前往商品管理的「商品列表」，可直接在列表上下架商品，或勾選多個商品後，點擊「更多操作」來批量更改',
    },
    {
        request: [
            '請問要如何新增商品',
            '新增商品該怎麼做',
            '新增商品在哪',
            '新增商品',
            '如何添加商品',
            '添加商品該怎麼做',
        ],
        response: '請前往商品管理的「商品列表」，點擊右上角「新增」即可新增商品',
    },
    {
        request: ['請問要如何匯出商品列表', '匯出商品列表要怎麼做', '有辦法匯出商品列表嗎'],
        response: '請前往商品管理的「商品列表」，點擊右上角「匯入」或「匯出」，即可匯入多個商品，或匯出當前搜尋結果的商品excel檔案',
    },
    {
        request: [
            '如何透過訂單編號查詢商品',
            '如何用商品條碼來搜尋商品',
            '有辦法在商品列表中加入篩選嗎',
            '排序建立時間為最新的商品列表',
        ],
        response: '請前往商品管理的「商品列表」，在列表左上方可以根據商品名稱、SKU、商品條碼等進行關鍵字搜尋，也可以在右上選擇篩選和排序，可以做到更仔細的商品查詢',
    },
    {
        request: [
            '如何新增商品規格',
            '如何編輯商品規格',
            '調整商品規格',
            '能更改商品規格的大小、尺寸、顏色、型號嗎',
            '新增規格',
            '如何修改規格',
        ],
        response: '請前往商品管理的「商品列表」，點擊任一商品，往下找到「商品規格」欄位，可以新增與編輯規格種類，下方「規格設定」將會顯示所有商品規格的組合',
    },
    {
        request: ['如何修改商品狀態', '如何編輯商品狀態為草稿的商品', '啟用商品該如何設定', '如何讓商品無法購買'],
        response: '請前往商品管理的「商品列表」，點擊任一商品，「商品狀態」在右上角，「啟用」為在前台公布並開放購買，「草稿」則在前台暫時不公布也不可購買',
    },
    {
        request: ['如何設定商品價格', '商品的原價該怎麼設定', '商品的價格該在哪裡設定'],
        response: '請前往商品管理的「商品列表」，點擊任一商品，若有多個規格請點擊任一規格，往下找到「定價」欄位，「售價」為消費者商品購買金額，「原價」為較高價格的售價，可依照銷售策略訂定您想要的價格',
    },
    {
        request: [
            '如何設定商品運費',
            '如何設定商品重量',
            '如何設定商品材積',
            '商品的重量該怎麼設定',
            '商品的材積該在哪裡設定',
        ],
        response: '請前往商品管理的「商品列表」，點擊任一商品，若有多個規格請點擊任一規格，往下找到「運費計算」欄位，可針對商品的運費計算方式選擇依照「材積」、「重量」或不計算，並在下方填入商品的單位值，隨後會依照商店設定中「運費設定」的級距後，計算出消費者購物車的運費總金額',
    },
    {
        request: ['如何新增商品分類', '商品分類該怎麼設定', '商品分類在哪裡設定'],
        response: '請前往商品管理的「商品分類」，點擊右上角「新增」，輸入分類標題與連結網址（唯一），並設定該分類的商品與SEO，即可儲存完成新增',
    },
    {
        request: ['如何編輯商品分類', '商品分類在哪裡編輯'],
        response: '請前往商品管理的「商品分類」，點擊任一商品分類進行編輯',
    },
    {
        request: ['如何刪除商品分類', '商品分類在哪裡刪除'],
        response: '請前往商品管理的「商品分類」，點擊任一商品分類，下方功能列中按下「刪除類別」，請注意刪除類別時，若有包含子類別，也將一併刪除',
    },
    {
        request: ['如何調整商品分類的順序', '想調整商品分類在前台的順序'],
        response: '請前往商品管理的「商品分類」，點擊右上角「編輯順序」，可拖曳父子層的類別，進而改變前台瀏覽商品的分類順序',
    },
    {
        request: ['如何設定商店的基本訊息', '如何設定商店的基本資料', '設定商店名稱和統一編號，該從哪裡開始'],
        response: '請前往商店設定的「商店訊息」，在基本資訊欄位可填寫商家資料，作為對外宣傳與首頁資訊',
    },
    {
        request: ['如何設定商店的SEO', '如何設定商店的圖示', '設定商店縮圖，該從哪裡開始'],
        response: '請前往商店設定的「商店訊息」，在SEO欄位可填寫商家在網頁上的SEO設定與圖片，並自訂網域、Google Analytics(GA4)、代碼管理工具',
    },
    {
        request: [
            '如何編輯商店金流',
            '商店線上或線下金流該怎麼設定',
            '商店的付款方式',
            'atm或貨到付款在哪裡設定',
            '信用卡付款方式在哪裡設定',
            '如何設定line pay',
        ],
        response: '請前往商店設定的「金流設定」，可管理線上與線下金流，無論是指定付款方式、付款告知提醒等，商家皆可自訂',
    },
    {
        request: [
            '如何編輯商店物流',
            '超商配送該怎麼設定',
            '711店到店如何設定',
            '全家店到店如何設定',
            'ok店到店如何設定',
            '萊爾富店到店如何設定',
            '交貨方式在哪裡設定',
        ],
        response: '請前往商店設定的「配送設定」，可設定啟用物流的方式，以及設定給消費者的配送說明，超商店到店請詳閱各大超商配送與價格資訊',
    },
    {
        request: ['如何填寫商店物流追蹤', '物流追蹤該怎麼設定', '如何新增物流追蹤'],
        response: '請前往商店設定的「配送設定」，點擊右上角的「物流追蹤設定」，可設定綠界物流參數，設定完成即可達成物流追蹤與托運單列印功能',
    },
    {
        request: ['如何填寫商店物流運費', '運費級距該怎麼設定'],
        response: '請前往商店設定的「運費設定」，可以設定訂單「總材積」或「總重量」所在的級距，進而計算該訂單運費金額',
    },
    {
        request: [
            '如何開啟或關閉購物金功能',
            '新加入會員購物金該怎麼設定',
            '購物金的使用期限',
            '生日禮發放購物金的方式',
            '如何設定購物金折抵上限',
            '如何允許購物金是否可折抵',
        ],
        response: '請前往商店設定的「購物金設定」，可以設定消費者在訂單結帳時可使用折抵的購物金，以及新註冊加入會員或會員生日禮的購物金自動發放、訂單折抵上限、購物金使用期限等',
    },
    {
        request: ['線上金流有哪些'],
        response: '我們有提供「藍新金流」與「綠界金流」的串接，並提供正式測試區切分與多種付款方式',
    },
    {
        request: ['線下金流有哪些'],
        response: '我們有提供「ATM轉帳」、「LINE PAY」與基本的「貨到付款」，在不執行線上付款時，可由店家自行與消費者商議付款方式',
    },
    {
        request: ['訂單重量的運費計算方式', '訂單材積的運費計算方式'],
        response: '訂單內的商品會設定依「重量」或依「材積」，分別做出總計，再按照總計值找出「運費設定」所設定的區間，算出該訂單的運費金額',
    },
    {
        request: ['購物金的用途是什麼', '什麼是購物金'],
        response: '購物金是商家發送給消費者的訂單可抵用金額，1點購物金代表1元，並搭配新加入會員、生日禮、優惠券，或是手動給予消費者購物金，來達到行銷作用',
    },
    {
        request: ['如何查看商品庫存', '什麼是商品庫存'],
        response: '請前往商品管理的「庫存列表」，會顯示商品的每個規格中各自的安全庫存與實際庫存數量，可即時查看與編輯值，點擊則可查看商品規格詳細資料',
    },
    {
        request: ['如何設定商品庫存'],
        response: '請前往商品管理的「商品列表」，點擊任一商品，若有多個規格請點擊任一規格，往下找到「庫存政策」欄位，可設定是否追蹤庫存，系統將會記錄購買商品時的增減',
    },
    {
        request: ['什麼是安全庫存'],
        response: '安全庫存指的是商品啟用庫存追蹤時，若實際庫存低於安全庫存量，系統將會通知商家，商品低於安全庫存量的提醒',
    },
    {
        request: ['什麼是POS'],
        response: 'POS是指在零售行業中用於處理交易的硬軟體組合。通常包括一台電腦、POS軟體、條碼掃描儀、收銀機、發票列印機和付款處理等設備',
    },
    {
        request: ['如何查看POS訂單', '怎麼篩選POS訂單'],
        response: '請前往訂單管理的「訂單」，在列表上方可以點選「POS訂單」的標籤，即可查看所有的POS訂單',
    },
    {
        request: ['什麼是已封存訂單'],
        response: '已封存的訂單將不會在所有訂單中顯示，需要到訂單管理的「已封存訂單」中解除封存訂單，才會顯示於所有訂單的列表中',
    },
    {
        request: ['如何新增退貨單'],
        response: '請前往訂單管理的「退貨單」，點擊右上角新增，輸入想要退貨的訂單編號，並設定退貨單的詳細內容，即可建立退貨單',
    },
    {
        request: ['如何新增顧客'],
        response: '請前往顧客管理的「顧客列表」，點擊右上角新增，輸入顧客基本資料，即可新增',
    },
    {
        request: ['如何加入黑名單', '什麼是顧客黑名單'],
        response: '請前往顧客管理的「顧客列表」，點擊想要加入黑名單的顧客，在顧客詳細右上角點擊「加入黑名單」即可，黑名單的顧客將無法登入與購物車結帳',
    },
    {
        request: ['什麼是顧客分群'],
        response: '顧客分群是將所有的顧客分類，目前有提供「電子郵件訂閱者」、「尚未成立有效訂單的顧客」、「已購買多次的顧客」，可透過顧客分群了解到不同客群有哪些會員',
    },
    {
        request: ['什麼是會員等級'],
        response: '會員等級是按照顧客訂單消費紀錄來給予不同等級的設定，條件可分為累計蕭累或單次消費，會員等級可以在優惠券、生日禮等活動時，界定不同內容與優惠身份',
    },
    {
        request: ['什麼是優惠券', '如何設定優惠券', '如何設定優惠促銷活動', '優惠券要怎麼新增', '如何建立優惠券'],
        response: '請前往優惠促銷的「折扣活動」，可以新增一個新的優惠券活動，可指定產品、顧客、設定金額、套用範圍、計算方式等，建立專屬店家的活動',
    },
    {
        request: ['怎樣啟用或關閉優惠券', '如何更改優惠券狀態'],
        response: '點擊任一優惠券，在設定中有「活動狀態」的按鈕，可以點擊啟用與關閉並儲存',
    },
    {
        request: [
            '如何設定優惠券代碼',
            '如何指定優惠券可使用的對象',
            '如何指定想要的顧客才可以使用的優惠券',
            '怎麼設定優惠券可使用的來源',
            '如何僅限POS使用優惠券',
        ],
        response: '點擊任一優惠券，在設定中有「活動方式」、「活動對象」、「可使用訂單來源」，這些設定可以限制優惠券的使用範圍與來源',
    },
    {
        request: [
            '如何設定優惠券折扣金額',
            '如何指定優惠券折抵的百分比',
            '怎麼設定優惠券套用的商品分類',
            '指定商品才可以使用優惠券',
            '如何應用優惠券到特定商品',
        ],
        response: '點擊任一優惠券，在設定中有「折扣金額」與「套用至」，這些設定可以限制優惠券折扣條件，以及在商品上的套用限制',
    },
    {
        request: ['如何設定優惠券消費條件', '如何指定滿額送', '怎麼設定優惠券觸發條件', '如何設定買幾送幾的優惠券'],
        response: '點擊任一優惠券，在設定中有「消費條件」、「計算單位」、「重複觸發」，這些設定可以讓優惠券有其觸發條件、是否重複觸發，以及計算單位的標的',
    },
    {
        request: [
            '如何設定優惠券使用次數',
            '如何設定全館使用次數',
            '怎麼設定一個人使用優惠券的次數',
            '指定優惠券使用次數',
        ],
        response: '點擊任一優惠券，在設定中有「全館總使用次數」與「個人總使用次數」，可以設定在全館或個人，在商店中無限制次數或限制使用次數',
    },
    {
        request: ['如何設定優惠券使用期限', '怎麼設定優惠券的開始時間與結束時間', '無期限的優惠券要如何設定'],
        response: '點擊任一優惠券，在設定中有「有效日期」，可以設定優惠券啟用的開始時間與結束時間',
    },
    {
        request: ['如何刪除優惠券'],
        response: '點擊任一優惠券，下方功能列有「刪除優惠券」，或是在列表勾選洗要刪除的優惠券，點擊「批量移除」，即可刪除優惠券',
    },
    {
        request: ['如何新增購物金', '如何發放購物金'],
        response: '請前往優惠促銷的「購物金紀錄」，點擊右上角新增，輸入欲增加或減少的金額，並設定天數，接著指定顧客，即可完成購物金增減',
    },
    {
        request: ['如何新增隱形賣場'],
        response: '請前往行銷推廣的「隱形賣場」，點擊右上角新增，選擇符合您需求的模板，接著設定網頁名稱、連結、SEO，以及賣場內的產品，儲存即可完成隱形賣場',
    },
    {
        request: ['什麼是隱形賣場'],
        response: '隱形賣場是指透過專屬的連結，可進入的賣場，只有透過專屬連結進入網站時，才可進入此隱形賣場，進而做到行銷與分流追蹤的目的',
    },
    {
        request: ['如何新增一頁商店'],
        response: '請前往行銷推廣的「一頁商店」，點擊右上角新增，選擇符合您需求的模板，接著設定網頁名稱、連結、SEO，以及賣場內的產品，儲存即可完成一頁商店',
    },
    {
        request: ['什麼是一頁商店'],
        response: '一頁商店是指透過單一頁面設計，推廣指定商品與類別，讓頁面獨立展現特色，進而做到行銷與分流追蹤的目的',
    },
    {
        request: ['如何設定分銷連結'],
        response: '請前往行銷推廣的「分銷連結」，點擊右上角新增，設定分銷代碼、導向的網址、專屬網址，以及分潤條件與類型，並設定推薦人，儲存即可完成分銷連結',
    },
    {
        request: ['什麼是分銷連結'],
        response: '分銷連結指的是特別給予推薦人引薦用的商城連結，透過推薦人的廣發與行銷，來達到觸擊連結的效果，讓電商與賣場得到更多關注與曝光率',
    },
    {
        request: ['分銷連結的推薦人是什麼', '如何新增推薦人'],
        response: '請前往行銷推廣的「推薦人列表」，點擊右上角新增，可新增行銷用的推薦人帳號，並可以在「分銷連結」設定上選取該推薦人',
    },
    {
        request: ['自動寄件是什麼功能', '如何使用自動寄件'],
        response: '自動寄件是系統在指定事件發生時自動發送的寄信功能，諸如商品出到貨、訂單成立與付款、生日祝福、客服訊息等寄件格式設定，以及是否啟用功能',
    },
    {
        request: ['手動寄件是什麼功能', '如何使用手動寄件'],
        response: '手動寄件是系統提供商家寄信給消費者的寄信功能，可以指定多個客群或顧客，輸入標題與內文，並指定寄送時間',
    },
    {
        request: [
            '如何自訂網頁主題',
            '如何設定網站佈景主題',
            '前台網頁要如何設計',
            '什麼是佈景主題',
            '如何修改網站排版',
            '網頁設計該怎麼做',
        ],
        response: '請前往品牌官網的「佈景主題」，在第一張卡的右側點擊「自訂」，即可進入頁面編輯系統，在該系統可以自由設定您想要的網站設計與排版',
    },
    {
        request: ['如何新增網誌文章', '網誌文章是什麼', '如何發佈網誌'],
        response: '請前往品牌官網的「網誌文章」，在右上角點擊新增，選定一個模板並設定網誌內容，儲存即建立網誌完成',
    },
    {
        request: ['如何設定分頁', '分頁列表是什麼', '分頁列表在哪'],
        response: '請前往品牌官網的「分頁列表」，列表是自訂新增的連結，可配合「佈景主題」在頁面中自訂添加需要有連結的地方',
    },
    {
        request: ['如何設定選單管理', '選單管理是什麼', '頁腳連結在哪', '導覽列的連結要如何設定', '如何設定主選單'],
        response: '請前往品牌官網的「選單管理」，選單分為主選單與頁腳，可加入指定的頁面連結與外部連結，系統將自動在每個頁面的頁首頁腳添加超連結',
    },
    {
        request: ['如何切換商店', '其他的商城要如何開啟', '切換商店的地方在哪', '如何新增商店'],
        response: '請移動至右上角會員頭像處，點擊「所有商店」，即可查看所有您建立的商店、當前方案與預覽圖',
    },
    {
        request: ['要如何為商品添加圖片和描述', '如何新增商品圖片或敘述'],
        response: '點擊任一商品編輯，可以在「商品說明」欄位添加商品的敘述，「圖片」則可以新增多張不同角度和種類的圖片',
    },
    {
        request: ['怎樣將商品分類到不同的分類目錄中', '可以將商品新增到不同的分類嗎'],
        response: '商品可以填加到多個不同的「商品分類」，在父層的商品分類中會同時包含底下的子層商品，讓您的商品有更多方式來分類',
    },
    {
        request: ['如何查看最新的訂單'],
        response: '訂單管理的「訂單」列表，預設已按照最新到最舊的方式排列',
    },
    {
        request: ['如何處理待處理的訂單', '如何篩選已付款的訂單'],
        response: '訂單管理的「訂單」列表右上有篩選器，可以從篩選器中選取訂單裝態處理中、付款狀態已付款等設定',
    },
    {
        request: ['怎樣查看訂單的配送地址', '怎樣查看訂購人資料', '如何知道訂單的結帳方式'],
        response: '訂單管理的「訂單」點選任一訂單，右側有「訂購人資料」、「收件人資料」、「付款方式」、「配送方式」，這些欄位可以讓您清楚知道訂單的消費者資訊',
    },
    {
        request: ['怎樣更新訂單的訂單狀態', '如何更新訂單的付款狀態', '訂單該怎麼更新出貨狀態'],
        response: '訂單管理的「訂單」點選任一訂單，可以查找「訂單狀態」、「付款狀態」、「配送狀態」，這些欄位可以讓您調整訂單的各項狀態',
    },
    {
        request: ['怎樣處理顧客在訂單的疑問', '如何回答顧客對訂單的疑問'],
        response: '顧客管理的「客服系統」可以針對不同的顧客來專一答覆，顧客在購物車結帳時也可以填寫備註，在訂單詳細裡的「訂單備註」中可以查看',
    },
    {
        request: ['如何查看顧客的訂單紀錄'],
        response: '顧客管理的「顧客列表」搜尋顧客後，點擊該顧客，顧客詳細中有「訂單記錄」，可查閱顧客訂單歷史紀錄',
    },
    {
        request: ['怎麼查找顧客的購物金紀錄'],
        response: '顧客管理的「顧客列表」搜尋顧客後，點擊該顧客，顧客詳細中有「購物金」，可瞭解到顧客現有購物金餘額，與購物金增減紀錄',
    },
    {
        request: ['怎麼設定免運費'],
        response: '請前往優惠促銷的「免運費活動」，可以新增一個免運費優惠券活動，並設定消費條件、觸發方式、使用期限等',
    },
];
Ai.defaultProduct = [
    {
        商品名稱: '黑色休閒西裝外套',
        描述: '這是一件輕便的黑色休閒西裝外套，帶有簡約的設計和自然垂墜的版型。',
    },
    {
        商品名稱: '金色百褶裙',
        描述: '這是一件閃亮的金色百褶裙。',
    },
    {
        商品名稱: '寬鬆版型西裝外套',
        描述: '這是一件寬鬆版型的千鳥格紋西裝外套，具有修身剪裁。',
    },
    { 商品名稱: '黑色瓦奇儂腰帶', 描述: '這是一件寬大的黑色皮革腰帶，搭配大號扣環，強調腰部線條。' },
];
//# sourceMappingURL=ai.js.map