import fs from 'fs';
import OpenAI from 'openai';
import tool from '../modules/tool.js';

export class Ai {
    public static files = {
        guide: '',
    };

    public static async initial() {
        // const file1 = 'defaultResponse.json';
        const file1 = tool.randomString(10) + '.json';
        const openai = new OpenAI({
            apiKey: process.env.OPENAI_API_KEY,
        });
        fs.writeFileSync(file1, JSON.stringify(this.defaultResponse));
        // return;
        // 上傳教學導引檔案
        const file = await openai.files.create({
            file: fs.createReadStream(file1),
            purpose: 'assistants',
        });
        Ai.files.guide = file.id;
        fs.rmSync(file1);
    }

    public static defaultResponse = [
        {
            question: ['請問要如何新增訂單？', '新增訂單該怎麼做？'],
            answer: '請前往訂單管理的「訂單」，點擊右上角「新增」即可新增訂單',
        },
        {
            question: ['請問要如何編輯訂單？', '編輯訂單該怎麼做？'],
            answer: '請前往訂單管理的「訂單」，點擊一份訂單進行編輯操作',
        },
        {
            question: ['請問要如何封存訂單？', '封存訂單該怎麼做？'],
            answer: '請前往訂單管理的「訂單」，在列表中勾選想要封存的訂單，即可批量封存',
        },
        {
            question: ['請問要如何解除封存訂單？', '解除封存訂單該怎麼做？'],
            answer: '請前往訂單管理的「已封存訂單」，在列表中勾選想要解除封存的訂單，即可批量解除封存',
        },
        {
            question: ['請問要如何搜尋訂單？', '搜尋訂單該怎麼做？', '我想要按照日期排序訂單，該怎麼做？', '可以只顯示付款狀態已付款的訂單嗎？'],
            answer: '請前往訂單管理的「訂單」，在列表左上方可以根據訂單編號、訂購人姓名、商品名稱等進行關鍵字搜尋，也可以在右上選擇篩選和排序，可以做到更仔細的訂單查詢',
        },
        {
            question: ['請問要如何查看訂單狀態？', '訂單付款狀態如何得知？', '訂單出貨狀態如何得知？', '請問出貨狀態在哪？'],
            answer: '請前往訂單管理的「訂單」，點擊任一訂單，在右上角有出貨狀態、付款狀態、訂單進度的顯示，也可以在詳細訂單中查看更多內容',
        },
        {
            question: ['請問要如何匯出訂單列表？', '匯出訂單列表要怎麼做？', '有辦法匯出訂單？'],
            answer: '請前往訂單管理的「訂單」，點擊右上角「匯出」即匯出當前搜尋結果的訂單excel檔案',
        },
        {
            question: ['請問要如何新增商品？', '新增商品該怎麼做？', '新增商品在哪？','新增商品'],
            answer: '請前往商品管理的「商品列表」，點擊右上角「新增」即可新增商品',
        },
        {
            question: ['請問要如何匯出商品列表？', '匯出商品列表要怎麼做？', '有辦法匯出商品列表嗎？'],
            answer: '請前往商品管理的「商品列表」，點擊右上角「匯入」或「匯出」，即可匯入多個商品，或匯出當前搜尋結果的商品excel檔案',
        },
    ];

    public static defaultResponse2 = [
        {
            tags: ['訂單'],
            keywords: ['新增'],
            response: '請前往訂單管理的「訂單」，點擊右上角「新增」即可新增訂單',
        },
        {
            tags: ['訂單'],
            keywords: ['編輯'],
            response: '請前往訂單管理的「訂單」，點擊一份訂單進行編輯操作',
        },
        {
            tags: ['訂單'],
            keywords: ['封存'],
            response: '請前往訂單管理的「訂單」，在列表中勾選想要封存的訂單，即可批量封存',
        },
        {
            tags: ['訂單'],
            keywords: ['解除封存'],
            response: '請前往訂單管理的「已封存訂單」，在列表中勾選想要解除封存的訂單，即可批量解除封存',
        },
        {
            tags: ['訂單'],
            keywords: ['搜尋', '查詢', '篩選', '排序'],
            response: '請前往訂單管理的「訂單」，在列表左上方可以根據訂單編號、訂購人姓名、商品名稱等進行關鍵字搜尋，也可以在右上選擇篩選和排序，可以做到更仔細的訂單查詢',
        },
        {
            tags: ['訂單'],
            keywords: ['訂單狀態', '出貨狀態', '付款狀態'],
            response: '請前往訂單管理的「訂單」，點擊任一訂單，在右上角有出貨狀態、付款狀態、訂單進度的顯示，也可以在詳細訂單中查看更多內容',
        },
        {
            tags: ['訂單'],
            keywords: ['匯出檔案', 'excel', 'xlsx'],
            response: '請前往訂單管理的「訂單」，點擊右上角「匯出」即匯出當前搜尋結果的訂單excel檔案',
        },
        {
            tags: ['商品'],
            keywords: ['新增'],
            response: '請前往商品管理的「商品列表」，點擊右上角「新增」即可新增商品',
        },
        {
            tags: ['商品'],
            keywords: ['匯入檔案', '匯出檔案', 'excel', 'xlsx'],
            response: '請前往商品管理的「商品列表」，點擊右上角「匯入」或「匯出」，即可匯入多個商品，或匯出當前搜尋結果的商品excel檔案',
        },
        {
            tags: ['商品'],
            keywords: ['上架', '下架'],
            response: '請前往商品管理的「商品列表」，可直接在列表上下架商品，或勾選多個商品後，點擊「更多操作」來批量更改',
        },
        {
            tags: ['商品'],
            keywords: ['搜尋', '查詢', '篩選', '排序'],
            response: '請前往商品管理的「商品列表」，在列表左上方可以根據商品名稱、SKU、商品條碼等進行關鍵字搜尋，也可以在右上選擇篩選和排序，可以做到更仔細的商品查詢',
        },
        {
            tags: ['商品'],
            keywords: ['規格', '顏色', '尺寸', '大小', '長寬', '型號'],
            response: '請前往商品管理的「商品列表」，點擊任一商品，往下找到「商品規格」欄位，可以新增與編輯規格種類，下方「規格設定」將會顯示所有商品規格的組合',
        },
        {
            tags: ['商品'],
            keywords: ['狀態'],
            response: '請前往商品管理的「商品列表」，點擊任一商品，「商品狀態」在右上角，「啟用」為在前台公布並開放購買，「草稿」則在前台暫時不公布也不可購買',
        },
        {
            tags: ['商品'],
            keywords: ['定價', '價格', '成本'],
            response:
                '請前往商品管理的「商品列表」，點擊任一商品，若有多個規格請點擊任一規格，往下找到「定價」欄位，「販售價格」為消費者商品購買金額，「比較價格」為較高價格的售價，可依照銷售策略訂定您想要的價格',
        },
        {
            tags: ['商品'],
            keywords: ['運費', '材積', '重量'],
            response:
                '請前往商品管理的「商品列表」，點擊任一商品，若有多個規格請點擊任一規格，往下找到「運費計算」欄位，可針對商品的運費計算方式選擇依照「材積」、「重量」或不計算，並在下方填入商品的單位值，隨後會依照商店設定中「運費設定」的級距後，計算出消費者購物車的運費總金額',
        },
        {
            tags: ['商品分類'],
            keywords: ['新增'],
            response: '請前往商品管理的「商品分類」，點擊右上角「新增」，輸入分類標題與連結網址（唯一），並設定該分類的商品與SEO，即可儲存完成新增',
        },
        {
            tags: ['商品分類'],
            keywords: ['編輯'],
            response: '請前往商品管理的「商品分類」，點擊任一商品分類進行編輯',
        },
        {
            tags: ['商品分類'],
            keywords: ['刪除'],
            response: '請前往商品管理的「商品分類」，點擊任一商品分類，下方功能列中按下「刪除類別」，請注意刪除類別時，若有包含子類別，也將一併刪除',
        },
        {
            tags: ['商品分類'],
            keywords: ['順序'],
            response: '請前往商品管理的「商品分類」，點擊右上角「編輯順序」，可拖曳父子層的類別，進而改變前台瀏覽商品的分類順序',
        },
        {
            tags: ['商店設定'],
            keywords: ['商店名稱', '商店類別', '統一編號'],
            response: '請前往商店設定的「商品訊息」，在基本資訊欄位可填寫商家資料，作為對外宣傳與首頁資訊',
        },
        {
            tags: ['商店設定'],
            keywords: ['SEO', '圖示', '縮圖'],
            response: '請前往商店設定的「商品訊息」，在SEO欄位可填寫商家在網頁上的SEO設定與圖片，並自訂網域、Google Analytics(GA4)、代碼管理工具',
        },
        {
            tags: ['金流'],
            keywords: ['線上金流', '線下金流', '藍新', '綠界', 'atm', 'line pay', '貨到付款', '信用卡', '付款方式'],
            response: '請前往商店設定的「金流設定」，可管理線上與線下金流，無論是指定付款方式、付款告知提醒等，商家皆可自訂',
        },
        {
            tags: ['配送'],
            keywords: ['宅配', '711', '全家', 'ok', '萊爾富', '店到店', 'c2c', '物流', '配送', '交貨', '物流追蹤'],
            response: '請前往商店設定的「配送設定」，可設定啟用物流的方式，以及設定給消費者的配送說明，超商店到店請詳閱各大超商配送與價格資訊',
        },
        {
            tags: ['配送'],
            keywords: ['物流追蹤'],
            response: '請前往商店設定的「配送設定」，點擊右上角的「物流追蹤設定」，可設定綠界物流參數，設定完成即可達成物流追蹤與托運單列印功能',
        },
        {
            tags: ['運費'],
            keywords: ['級距', '重量', '材積', '公斤', '長寬高'],
            response: '請前往商店設定的「運費設定」，可以設定訂單「總材積」或「總重量」所在的級距，進而計算該訂單運費金額',
        },
        {
            tags: ['購物金'],
            keywords: ['開啟功能', '關閉功能', '新加入', '使用期限', '生日禮', '折抵上限', '允許折抵'],
            response: '請前往商店設定的「購物金設定」，可以設定消費者在訂單結帳時可使用折抵的購物金，以及新註冊加入會員或會員生日禮的購物金自動發放、訂單折抵上限、購物金使用期限等',
        },
    ];
}
